Revit 2027 API
VertexPositionColored Class
 A geometry vertex specified as a position in space with a color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Vertex
 Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexPositionColored : Vertex
Public Class VertexPositionColored
	Inherits Vertex
public ref class VertexPositionColored : public Vertex
type VertexPositionColored =
    class
        inherit Vertex
    end
The VertexPositionColored type exposes the following members.
Constructors
Name | Description
VertexPositionColored |  Constructs the vertex from a point and a color.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Vertex)
Position |  The vertex's position.
Top
Methods
Name | Description
Dispose
(Inherited from Vertex)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetColor |  Gets the vertex's color.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSizeInFloats |  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetColor |  Sets the vertex's color.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The color of these vertices includes a transparency component In order to render them as transparent they must be rendered in the transparent pass See the 'IsTransparentPass' method of DrawContext
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace